/**
 * fallback care type constants
 * - api 호출 실패 시 사용
 */
export const FALLBACK_CARE_CONSTANTS = {
  // workTypeList
  2: '방문요양',
  3: '입주요양',
  4: '방문목욕',
  5: '주야간보호',
  6: '요양원',
  7: '병원',
  8: '병원동행',

  // welfareList
  10: '4대보험',
  11: '퇴직급여',
  12: '명절선물',
  13: '장기근속 장려금',
  14: '중증가산수당',
  15: '교통비 지원',
  16: '경조사비',
  17: '식사(비) 지원',
  18: '정부지원금',
  19: '운전 수당',

  // careLevelList
  21: '등급없음',
  22: '1등급',
  23: '2등급',
  24: '3등급',
  25: '4등급',
  26: '5등급',
  27: '인지지원 등급',

  // dementiaSymptomList
  29: '정상 (치매 증상 없음)',
  30: '했던 말을 반복하는 등 단기 기억 장애',
  31: '길을 잃거나 자주 가던 곳을 헤맴',
  32: '어린아이 같은 행동',
  33: '집 밖을 배회',
  34: '가족을 알아보지 못함',
  35: '사람을 의심하는 망상',
  36: '때리거나 욕설 등 공격적인 행동',

  // inmateStateList
  38: '독거',
  39: '배우자와 동거, 돌봄 시간 중 집에 있음',
  40: '배우자와 동거, 돌봄 시간 중 자리 비움',
  41: '다른 가족과 동거, 돌봄 시간 중 집에 있음',
  42: '다른 가족과 동거, 돌봄 시간 중 자리 비움',

  // serviceMealList
  45: '스스로 식사 가능',
  46: '식사 차려드리기',
  47: '죽, 반찬 등 요리 필요',
  48: '경관식 보조',

  // serviceToiletList
  50: '스스로 배변 가능',
  51: '가끔 대소변 실수 시 도움',
  52: '기저귀 케어 필요',
  53: '유치도뇨/방광루/장루 관리',

  // serviceMobilityList
  55: '스스로 거동 가능',
  56: '이동시 부축 도움',
  57: '휠체어 이동 보조',
  58: '거동 불가',

  // serviceDailyList
  60: '청소,빨래 보조',
  61: '목욕 보조',
  62: '병원 동행',
  63: '산책, 간단한 운동',
  64: '말벗 등 정서지원',
  65: '인지자극 활동',

  // gender
  67: '남성',
  68: '여성',
};
